---
kind: property
id: P:Autodesk.Revit.DB.OverrideGraphicSettings.ProjectionLinePatternId
source: html/1aa202a8-bc28-bd00-e00b-3ea339d83ac1.htm
---
# Autodesk.Revit.DB.OverrideGraphicSettings.ProjectionLinePatternId Property

Id of the projection surface line pattern.

## Syntax (C#)
```csharp
public ElementId ProjectionLinePatternId { get; }
```